export const stageColors = {
  "Лид": "#4186f5",
  "Изучаем ТЗ": "#6a9ef2", 
  "Обсуждаем с клиентом": "#6a9ef2",
  "Клиент думает": "#f6b16b",
  "Ожидаем предоплату": "#e59037",
  "Взяли в работу": "#8d7cc2",
  "Ведется разработка": "#6650a5",
  "На уточнении у клиента": "#c17ba0",
  "Тестируем": "#feda60",
  "Тестирует клиент": "#fabd03",
  "На доработке": "#f0c332",
  "Ожидаем оплату": "#69a84f",
  "Успешно завершен": "#36a850",
  "Закрыт": "#46bcc6",
  "Неудачно завершён": "#e94335",
  "Удаленные": "#252531"
};


export const getStageColor = (stage) => {
  return stageColors[stage] || "#74B9FF";
};